packerlschupfer/ESP32-Logger/src/Logger.cpp
    // Initialize tag levels array
    memset(tagLevels_, 0, sizeof(tagLevels_));

#ifdef LOG_DEFERRED_FORMAT
    autostartLogTask();  // last: the task may start running immediately
#endif
}

Logger::Logger(std::shared_ptr<ILogBackend> backend)
    : backendMutex(createMutexSafe()),
      subscriberMutex(createMutexSafe()),
      tagMutex(createMutexSafe()),
      rateLimitMutex(createMutexSafe()),
      lastLogTime(0),
      logCounter(0) {
#ifdef LOG_DEFERRED_FORMAT
    DeferredLog::init();
    drainMutex_ = createMutexSafe();
#endif
    if (backend) {
        backends.push_back(std::move(backend));
    } else {
        backends.push_back(std::make_shared<NonBlockingConsoleBackend>());
    }

    // Initialize tag levels array
    memset(tagLevels_, 0, sizeof(tagLevels_));

#ifdef LOG_DEFERRED_FORMAT
    autostartLogTask();  // last: the task may start running immediately
#endif
}

Logger::~Logger() {
    // Stop subscriber task first (this also cleans up queue)
    stopSubscriberTask();

    if (backendMutex) vSemaphoreDelete(backendMutex);
    if (subscriberMutex) vSemaphoreDelete(subscriberMutex);
    if (tagMutex) vSemaphoreDelete(tagMutex);
    if (rateLimitMutex) vSemaphoreDelete(rateLimitMutex);
#ifdef LOG_DEFERRED_FORMAT
    if (drainMutex_) vSemaphoreDelete(drainMutex_);
#endif
}

Logger& Logger::getInstance() {
    static Logger instance;
    return instance;
}

void Logger::init(size_t bufferSize) {
    // Buffer size is now fixed by CONFIG_LOG_BUFFER_SIZE
    // This method kept for API compatibility
    initialized_.store(true);
}

void Logger::configure(const LoggerConfig& config) {
    // Mark as initialized since configure() is explicit setup
    initialized_.store(true);

    // Apply global settings
    setLogLevel(config.defaultLevel);
    enableLogging(config.enableLogging);
    setMaxLogsPerSecond(config.maxLogsPerSecond);
    
    // Configure backend
    switch (config.primaryBackend) {
        case LoggerConfig::BackendType::CONSOLE:
            setBackend(std::make_shared<ConsoleBackend>());
            break;
        case LoggerConfig::BackendType::SYNCHRONIZED_CONSOLE:
            setBackend(std::make_shared<SynchronizedConsoleBackend>());
            break;
        case LoggerConfig::BackendType::NON_BLOCKING_CONSOLE:
            setBackend(std::make_shared<NonBlockingConsoleBackend>());
            break;
        case LoggerConfig::BackendType::CUSTOM:
            // User should set custom backend separately
            break;
    }
    
    // Apply tag configurations
    for (size_t i = 0; i < config.tagConfigCount; ++i) {
        const auto& tagConfig = config.tagConfigs[i];
        if (tagConfig.tag) {
            setTagLevel(tagConfig.tag, tagConfig.level);
        }
    }
}

void Logger::enableLogging(bool enable) {
    isLoggingEnabled.store(enable);
}

void Logger::setLogLevel(esp_log_level_t level) {
    globalLogLevel.store(level);
}

void Logger::setMaxLogsPerSecond(uint32_t maxLogs) {
    maxLogsPerSecond.store(maxLogs);
}

void Logger::setBackend(std::shared_ptr<ILogBackend> newBackend) {
    // Allow operation without mutex if scheduler not started (single-threaded)
    if (!backendMutex) {
        backends.clear();
        if (newBackend) {
            backends.push_back(std::move(newBackend));
        }
        return;
    }

    if (xSemaphoreTake(backendMutex, pdMS_TO_TICKS(LoggerConfig::MUTEX_SHORT_TIMEOUT_MS)) == pdTRUE) {
        backends.clear();
        if (newBackend) {
            backends.push_back(std::move(newBackend));
        }
        xSemaphoreGive(backendMutex);
    }
}

void Logger::addBackend(std::shared_ptr<ILogBackend> backend) {
    if (!backend) return;

    // Allow operation without mutex if scheduler not started (single-threaded)
    if (!backendMutex) {
        backends.push_back(std::move(backend));
        return;
    }

    if (xSemaphoreTake(backendMutex, pdMS_TO_TICKS(LoggerConfig::MUTEX_SHORT_TIMEOUT_MS)) == pdTRUE) {
        backends.push_back(std::move(backend));
        xSemaphoreGive(backendMutex);
    }
}

void Logger::removeBackend(std::shared_ptr<ILogBackend> backend) {
    if (!backend) return;

    // Allow operation without mutex if scheduler not started (single-threaded)
    if (!backendMutex) {
        backends.erase(
            std::remove(backends.begin(), backends.end(), backend),
            backends.end()
        );
        return;
    }

    if (xSemaphoreTake(backendMutex, pdMS_TO_TICKS(LoggerConfig::MUTEX_SHORT_TIMEOUT_MS)) == pdTRUE) {
        backends.erase(
            std::remove(backends.begin(), backends.end(), backend),
            backends.end()
        );
        xSemaphoreGive(backendMutex);
    }
}

void Logger::clearBackends() {
    // Allow operation without mutex if scheduler not started (single-threaded)
    if (!backendMutex) {
        backends.clear();
        return;
    }

    if (xSemaphoreTake(backendMutex, pdMS_TO_TICKS(LoggerConfig::MUTEX_SHORT_TIMEOUT_MS)) == pdTRUE) {
        backends.clear();
        xSemaphoreGive(backendMutex);
    }
}

void Logger::setTagLevel(const char* tag, esp_log_level_t level) {
    if (!tag || strlen(tag) == 0) return;

    size_t tagLen = strlen(tag);
    if (tagLen >= CONFIG_LOG_SUBSCRIBER_TAG_SIZE) {
        tagLen = CONFIG_LOG_SUBSCRIBER_TAG_SIZE - 1;  // Truncate if too long
    }

    // Helper lambda to set tag level (no heap allocation)
    auto doSetTagLevel = [this, tag, tagLen, level]() {
        size_t count = tagLevelCount_.load();

        // First, check if tag already exists and update it
        for (size_t i = 0; i < count; i++) {
            if (strncmp(tagLevels_[i].tag, tag, CONFIG_LOG_SUBSCRIBER_TAG_SIZE) == 0) {
                tagLevels_[i].level = level;
                esp_log_level_set(tag, level);
                return;
            }
        }

        // Tag not found - add new entry if space available
        if (count < CONFIG_LOG_MAX_TAGS) {
            memcpy(tagLevels_[count].tag, tag, tagLen);
            tagLevels_[count].tag[tagLen] = '\0';
            tagLevels_[count].level = level;
            tagLevelCount_.store(count + 1);
            esp_log_level_set(tag, level);
        }
    };

    // Allow operation without mutex if scheduler not started (single-threaded)
    if (!tagMutex) {
        doSetTagLevel();
        return;
    }

    if (xSemaphoreTake(tagMutex, pdMS_TO_TICKS(LoggerConfig::MUTEX_SHORT_TIMEOUT_MS)) == pdTRUE) {
        doSetTagLevel();
        xSemaphoreGive(tagMutex);
    } else {
        mutexTimeouts_.fetch_add(1);
    }
}

