packerlschupfer/ESP32-Logger/src/Logger.cpp
esp_log_level_t Logger::getTagLevel(const char* tag) const {
    if (!tag) return globalLogLevel.load();

    esp_log_level_t level = globalLogLevel.load();

    // Return global level if no mutex (pre-scheduler, can't safely access tagLevels_)
    if (!tagMutex) {
        return level;
    }

    if (xSemaphoreTake(tagMutex, pdMS_TO_TICKS(LoggerConfig::MUTEX_SHORT_TIMEOUT_MS)) == pdTRUE) {
        size_t count = tagLevelCount_.load();
        for (size_t i = 0; i < count; i++) {
            if (strncmp(tagLevels_[i].tag, tag, CONFIG_LOG_SUBSCRIBER_TAG_SIZE) == 0) {
                level = tagLevels_[i].level;
                break;
            }
        }
        xSemaphoreGive(tagMutex);
    }

    return level;
}

bool Logger::isLevelEnabledForTag(const char* tag, esp_log_level_t level) const {
    if (!isLoggingEnabled.load()) return false;

    // ESP_LOG_NONE should never be logged
    if (level == ESP_LOG_NONE) return false;

    // If no tag, use global level
    if (!tag) {
        return level <= globalLogLevel.load();
    }

    // Check tag-specific level first
    esp_log_level_t effectiveLevel = globalLogLevel.load();

    // Check if mutex exists before trying to take it (may be null if scheduler not started)
    if (tagMutex) {
        if (xSemaphoreTake(tagMutex, pdMS_TO_TICKS(LoggerConfig::MUTEX_SHORT_TIMEOUT_MS)) == pdTRUE) {
            size_t count = tagLevelCount_.load();
            for (size_t i = 0; i < count; i++) {
                if (strncmp(tagLevels_[i].tag, tag, CONFIG_LOG_SUBSCRIBER_TAG_SIZE) == 0) {
                    effectiveLevel = tagLevels_[i].level;
                    break;
                }
            }
            xSemaphoreGive(tagMutex);
        }
    }
    // If no mutex, just use global level (can't check tag-specific levels safely)

    // Use tag-specific level if configured, otherwise use global level
    return level <= effectiveLevel;
}

bool Logger::checkRateLimit() {
    uint32_t maxPerSec = maxLogsPerSecond.load();
    if (maxPerSec == 0) return true;  // Unlimited

    // Allow logging if no mutex (pre-scheduler)
    if (!rateLimitMutex) {
        return true;
    }

    bool allowed = false;

    if (xSemaphoreTake(rateLimitMutex, pdMS_TO_TICKS(LoggerConfig::MUTEX_MEDIUM_TIMEOUT_MS)) == pdTRUE) {
        uint32_t currentTime = millis();
        // Handle millis() wrap-around gracefully (after ~49 days)
        // Unsigned subtraction handles wrap correctly: if currentTime wrapped,
        // elapsed will be a large value which correctly triggers reset
        uint32_t elapsed = currentTime - lastLogTime;

        if (elapsed >= LoggerConfig::RATE_LIMIT_WINDOW_MS) {
            // New window - reset counter
            lastLogTime = currentTime;
            logCounter = 1;
            allowed = true;
        } else if (logCounter < maxPerSec) {
            logCounter++;
            allowed = true;
        } else {
            droppedLogs.fetch_add(1);
            allowed = false;
        }

        xSemaphoreGive(rateLimitMutex);
    } else {
        // Mutex timeout - track for diagnostics
        mutexTimeouts_.fetch_add(1);
    }

    return allowed;
}

void Logger::writeToBackends(const char* message, size_t length) {
    // Fallback: write directly without mutex protection (pre-scheduler)
    if (!backendMutex) {
        for (auto& backend : backends) {
            if (backend) {
                backend->write(message, length);
            }
        }
        return;
    }

    if (xSemaphoreTake(backendMutex, pdMS_TO_TICKS(LoggerConfig::MUTEX_STANDARD_TIMEOUT_MS)) == pdTRUE) {
        for (auto& backend : backends) {
            if (backend) {
                backend->write(message, length);
            }
        }
        xSemaphoreGive(backendMutex);
    }
}

void Logger::log(esp_log_level_t level, const char* tag, const char* format, ...) {
    if (!isLevelEnabledForTag(tag, level)) return;
    
    va_list args;
    va_start(args, format);
    logV(level, tag, format, args);
    va_end(args);
}

void Logger::logV(esp_log_level_t level, const char* tag, const char* format, va_list args) {
    if (!isLevelEnabledForTag(tag, level)) return;
    if (!checkRateLimit()) return;

#ifdef LOG_DEFERRED_FORMAT
    // No formatting on the caller's stack: capture and hand off to the logger task
    enqueueDeferred(level, tag, 0, format, args);
#else
    auto& pool = BufferPool::getInstance();

    // Get buffer from pool
    char* formatBuffer = pool.acquire();
    if (!formatBuffer) return;

    // Format the message
    vsnprintf(formatBuffer, CONFIG_LOG_BUFFER_SIZE, format, args);

    // Notify subscribers with formatted message (before adding timestamp/task info)
    notifySubscribers(level, tag, formatBuffer);

    // Get another buffer for full message
    char* fullMessage = pool.acquire();
    if (fullMessage) {
        // Format complete message
        int len = snprintf(fullMessage, CONFIG_LOG_BUFFER_SIZE,
                          "[%lu][%s][%s] %s: %s\r\n",
                          millis(),
                          pcTaskGetName(NULL) ?: "?",
                          levelToString(level),
                          tag ?: "?",
                          formatBuffer);

        // Ensure message wasn't truncated
        if (len >= CONFIG_LOG_BUFFER_SIZE) {
            len = CONFIG_LOG_BUFFER_SIZE - 1;
            fullMessage[len] = '\0';  // Ensure null termination
        }

        // Write to all backends
        writeToBackends(fullMessage, len);

        pool.release(fullMessage);
    } else {
        // Fallback to ESP-IDF logging
        esp_log_write(level, tag, "%s", formatBuffer);
    }

    pool.release(formatBuffer);
#endif
}

void Logger::logNnL(esp_log_level_t level, const char* tag, const char* format, ...) {
    if (!isLevelEnabledForTag(tag, level)) return;
    if (!checkRateLimit()) return;

    va_list args;
    va_start(args, format);

#ifdef LOG_DEFERRED_FORMAT
    enqueueDeferred(level, tag, DeferredLog::FLAG_NO_NEWLINE, format, args);
    va_end(args);
#else
    auto& pool = BufferPool::getInstance();

    char* formatBuffer = pool.acquire();
    if (!formatBuffer) {
        va_end(args);
        return;
    }

    vsnprintf(formatBuffer, CONFIG_LOG_BUFFER_SIZE, format, args);
    va_end(args);

    // Notify subscribers with formatted message (before adding timestamp/task info)
    notifySubscribers(level, tag, formatBuffer);

    char* fullMessage = pool.acquire();
    if (fullMessage) {
        int len = snprintf(fullMessage, CONFIG_LOG_BUFFER_SIZE,
                          "[%lu][%s][%s] %s: %s",  // No newline
                          millis(),
                          pcTaskGetName(NULL) ?: "?",
                          levelToString(level),
                          tag ?: "?",
                          formatBuffer);

        writeToBackends(fullMessage, len);
        pool.release(fullMessage);
    }

    pool.release(formatBuffer);
#endif
}

